_posts/2015-09-07-emacsconf-2015.html
---
layout: post
title:  "Emacsconf 2015"
date:   2015-09-07
categories:
---

<p>
The other week, I went to Emacsconf in SF - being there for part of it and the rest watching through the stream. It was definitely a great use of time, and I was hoping to write down the little lessons to help crystalize them:
</p>
<ol class="org-ol">
<li>Howard Abrams is a god of Emacs. His presentation was one of the most impressive displays of Emacs-ing I've ever seen. I think this was great for me, because it really opened my eyes to more of what is possible with Emacs, and gives me someone to look up towards.</li>
<li>I still have a lot to improve on in my workflow. The lightning talks/IRC channel were great for figuring out new ways to improve my workflow. Things that I want to try include:
<ul class="org-ul">
<li>ledger</li>
<li>mu4e</li>
<li>eshell</li>
<li>my own literate devops</li>
<li>writing an org-mode exporter</li>
<li>watching "Emacs Lisp development tips" from John Wiegley: <a href="http://www.youtube.com/watch?v=QRBcm6jFJ3Q">http://www.youtube.com/watch?v=QRBcm6jFJ3Q</a></li>
</ul></li>
<li><code>calc</code> is awesome! Ever since the lightning talk, I've been using it a bunch instead of opening up a Python REPL.</li>
</ol>

<p>
And now, the big lessons:
</p>
<ol class="org-ol">
<li>This one is inspired by one of the guys I chatted with there, who didn't even use Emacs. I normally wouldn't have gone to a conference about something I wasn't already extremely into, but this guy going is, in hindsight, a brilliantly time-efficient way to learn about something. I should definitely copy this move. (:</li>
<li>I have a lot to learn from others, but I should seek those others out so we can all learn together. The funny thing is that I knew this for all sorts of other topics, but I never really considered reaching out to people about Emacs, which seems a little silly in hindsight. I'm definitely looking forward to the SF Emacs meetups.</li>
</ol>
